In [5]:
import numpy as np
import pandas as pd

### Pivot Tables

In [6]:
data={
    'Date':pd.date_range('2026-02-02',periods=20),
    'Product':['A','B','C','D']*5,
    'Region':['East','West','North','South']*5,
    'Sales':np.random.randint(100,2000,20),
    'Units':np.random.randint(10,100,20),
    'Rep':['John','Mary','Bob','Alice']*5
}

df=pd.DataFrame(data)

In [11]:
df

         Date Product Region  Sales  Units    Rep     Month Quarter
0  2026-02-02       A   East    526     24   John  February      Q1
1  2026-02-03       B   West    584     39   Mary  February      Q1
2  2026-02-04       C  North    635     14    Bob  February      Q1
3  2026-02-05       D  South   1331     19  Alice  February      Q1
4  2026-02-06       A   East    499     76   John  February      Q1
5  2026-02-07       B   West    923     10   Mary  February      Q1
6  2026-02-08       C  North   1144     82    Bob  February      Q1
7  2026-02-09       D  South    920     15  Alice  February      Q1
8  2026-02-10       A   East    868     82   John  February      Q1
9  2026-02-11       B   West    285     23   Mary  February      Q1
10 2026-02-12       C  North    394     45    Bob  February      Q1
11 2026-02-13       D  South    477     90  Alice  February      Q1
12 2026-02-14       A   East    346     53   John  February      Q1
13 2026-02-15       B   West   1982     66   Mary  February      Q1
14 2026-02-16       C  North    635     91    Bob  February      Q1
15 2026-02-17       D  South    722     84  Alice  February      Q1
16 2026-02-18       A   East    186     94   John  February      Q1
17 2026-02-19       B   West    308     29   Mary  February      Q1
18 2026-02-20       C  North    328     83    Bob  February      Q1
19 2026-02-21       D  South   1043     76  Alice  February      Q1

In [8]:
df['Month']=df['Date'].dt.month_name()

In [10]:
df['Quarter']='Q'+ df['Date'].dt.quarter.astype(str)

In [12]:
pd.pivot_table(df,values='Sales',index='Region',columns='Product')

Product      A      B      C      D
Region
East     485.0    NaN    NaN    NaN
North      NaN    NaN  627.2    NaN
South      NaN    NaN    NaN  898.6
West       NaN  816.4    NaN    NaN

In [13]:
pd.pivot_table(df,values='Sales',index='Region',columns='Product',aggfunc='median')

Product      A      B      C      D
Region
East     499.0    NaN    NaN    NaN
North      NaN    NaN  635.0    NaN
South      NaN    NaN    NaN  920.0
West       NaN  584.0    NaN    NaN

In [14]:
pd.pivot_table(df,values=['Sales','Units'],index='Region',columns='Product')

         Sales                      Units
Product      A      B      C      D     A     B     C     D
Region
East     485.0    NaN    NaN    NaN  65.8   NaN   NaN   NaN
North      NaN    NaN  627.2    NaN   NaN   NaN  63.0   NaN
South      NaN    NaN    NaN  898.6   NaN   NaN   NaN  56.8
West       NaN  816.4    NaN    NaN   NaN  33.4   NaN   NaN

### Cross Table

In [15]:
pd.crosstab(df['Region'],df['Product'])

Product  A  B  C  D
Region
East     5  0  0  0
North    0  0  5  0
South    0  0  0  5
West     0  5  0  0